# The sinking of the Titanic is one of the most infamous shipwrecks in history. Some key points are:  
● On April 15, 1912, during her maiden voyage, the Titanic sank after colliding with an iceberg, killing 1502 out of 2224 passengers and crew. Translated 32% survival rate. 
● One of the reasons that the shipwreck led to such loss of life was that there were not enough lifeboats for the passengers and crew. 
● Although there was some element of luck involved in surviving the sinking, some groups of people were more likely to survive than others, such as women, children, and the upper-class.

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('train.csv')

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 1. Find the total number of males and females on-board.

In [4]:
print("Total No. of males on-board: ", len(data[data['Sex'] == 'female']))

Total No. of males on-board:  314

In [5]:
print("Total No. of females on-board: ", len(data[data['Sex'] == 'male']))

Total No. of females on-board:  577

# 2. Find the total number of males survived during the disaster

In [6]:
male_survived = data[(data['Sex'] == 'male') & (data['Survived'] == 1)]

In [7]:
print(len(male_survived))

109

# 3. Find the total number of females surviving traveling on passenger class 1.

In [8]:
female_survived_class_1 = data[(data['Sex'] == 'female') & (data['Survived'] == 1) & (data['Pclass'] == 1)]

In [9]:
print("Total No. of females survived traveling on Passenger Class 1: ", len(female_survived_class_1))

Total No. of females survived traveling on Passenger Class 1:  91

# 4. Find the average fare paid by passengers traveling on passenger class 2.

In [10]:
fair_passenger_class_2 = data[(data['Pclass'] == 2)]

In [11]:
fair_passenger_class_2_avg = (fair_passenger_class_2['Fare'].mean())

In [12]:
print("Average fre paid by passengers traveling on passenger class 2: ", fair_passenger_class_2_avg)

Average fre paid by passengers traveling on passenger class 2:  20.66218315217391

# 5. Find the ten oldest passengers traveling on ship.

In [13]:
ten_oldest_passengers = data.nlargest(10, ['Age'])

In [14]:
ten_oldest_passengers

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q

# 6. What gender has the most survival rate, describe your answer in %age.

In [15]:
survival_men = data[(data['Survived'] == 1) & (data['Sex'] == 'male')]

In [16]:
survival_men

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
...,...,...,...,...,...,...,...,...,...,...,...,...
838,839,1,3,"Chip, Mr. Chang",male,32.0,0,0,1601,56.4958,NaN,S
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [17]:
survival_men_rate = survival_men['Age'].mean()

In [18]:
print("Survival Men Rate: ", survival_men_rate)

Survival Men Rate:  27.276021505376345

In [19]:
survival_female = data[(data['Survived'] == 1) & (data['Sex'] == 'female')]

In [20]:
survival_female_rate = survival_female['Age'].mean()

In [21]:
print("Survival Female Rate: ", survival_female_rate)

Survival Female Rate:  28.84771573604061

In [23]:
if survival_men_rate > survival_female_rate:
    print("Men survival rate is greater than Female having %age ratio: ", survival_men_rate)
else:
    print("Female survival rate is greater than Men having %age ratio: ", survival_female_rate)

Female survival rate is greater than Men having %age ratio:  28.84771573604061

# 7. Find out the two columns having most null values, Your job is to fill out these cells, (tip: one can use either mean value or most duplicated value of column

In [24]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [25]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [28]:
#Since Cabin is column with string values therefore,
data['Cabin'].value_counts()

C23 C25 C27    4
B96 B98        4
G6             4
F2             3
F33            3
              ..
A26            1
A23            1
E63            1
B101           1
D11            1
Name: Cabin, Length: 147, dtype: int64

In [30]:
#So we can either replace null values in Cabin column with C23, C25 or C27 
clean_data = data
clean_data['Cabin'] = clean_data['Cabin'].replace(np.nan, 'C23')

In [31]:
clean_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin            0
Embarked         2
dtype: int64

In [32]:
avg_age = clean_data['Age'].mean()

In [33]:
clean_data['Age'] = clean_data['Age'].replace(np.nan, avg_age)

In [34]:
clean_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
dtype: int64

In [35]:
clean_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C23,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C23,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C23,S

# 8. Find the age of the passenger who paid most of the fare.

In [43]:
largest_fare = clean_data.nlargest(1, ['Fare'])

In [44]:
largest_age = largest_fare['Age']

In [45]:
print("Largest Age: ", largest_age)

Largest Age:  258    35.0
Name: Age, dtype: float64

# 9. Name the most and least important features (columns) to be used for machine learning in the dataset.

In [46]:
clean_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C23,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C23,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C23,S

In [47]:
important_features = clean_data[['Survived','Pclass', 'Sex','Age','SibSp','Parch', 'Fare', 'Cabin']]

# 10. Children (Age<?) were more likely to have survived.

In [48]:
clean_data['Age'].value_counts()

29.699118    177
24.000000     30
22.000000     27
18.000000     26
28.000000     25
            ...
55.500000      1
53.000000      1
20.500000      1
23.500000      1
0.420000       1
Name: Age, Length: 89, dtype: int64